### APERTURA Y EXPLORACIÓN DEL ARCHIVO: ***data_xml_clean.xml***
---

In [14]:
# Importamos las librerias

import pandas as pd
import numpy as np

In [15]:
# Abrimos el archivo, las primeras líneas del DataFrame

data_xml = pd.read_xml('../Archivos/data_xml_clean.xml')
data_xml.head()

   level_0  index  time    age gender
0        0      0   910  50-54    Man
1        1      1   784  50-54    Man
2        2      2   924  22-24    Man
3        3      3   575  45-49    Man
4        4      4   781  45-49    Man

In [16]:
# Listamos las columnas que tiene el DF

list(data_xml.columns)

['level_0', 'index', 'time', 'age', 'gender']

In [17]:
# Vemos la forma que tiene el DF

data_xml.shape
f'Las filas y columnas del archivo son {data_xml.shape}'

'Las filas y columnas del archivo son (25973, 5)'

In [18]:
# Vemos el tamaño del DF

data_xml.size

129865

In [19]:
# Vemos la información general del DF

data_xml.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25973 entries, 0 to 25972
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   level_0  25973 non-null  int64
 1   index    25973 non-null  int64
 2   time     25973 non-null  int64
 3   age      25973 non-null  object
 4   gender   25973 non-null  object
dtypes: int64(3), object(2)
memory usage: 1014.7+ KB

In [20]:
# Vemos la descripción transpuesta(.T) de las columnas numéricas

data_xml.describe().T

,count,mean,std,min,25%,50%,75%,max
level_0,25973.0,12986.000000,7497.903607,0.0,6493.0,12986.0,19479.0,25972.0
index,25973.0,12986.000000,7497.903607,0.0,6493.0,12986.0,19479.0,25972.0
time,25973.0,11054.664921,101471.622125,120.0,443.0,656.0,1038.0,2488653.0

In [21]:
# Incluimos la descripción de las columnas tipo string/object

data_xml.describe(include = 'object').T

        count unique    top   freq
age     25973     11  25-29   4931
gender  25973      5    Man  20598

In [22]:
# Comprobamos si hay filas duplicadas

data_xml.duplicated().sum()

0

In [23]:
# Vemos el porcentaje de valores nulos 

data_xml.isnull().sum()/len(data_xml)*100

level_0    0.0
index      0.0
time       0.0
age        0.0
gender     0.0
dtype: float64

---

### UNIFICACIÓN Y MODIFICACIONES

In [24]:
# Borramos la columna level_0 por tener otro índice con la misma información

data_xml.drop(['level_0', "time"], axis = 1, inplace = True)

In [25]:
data_xml

       index    age gender
0          0  50-54    Man
1          1  50-54    Man
2          2  22-24    Man
3          3  45-49    Man
4          4  45-49    Man
...      ...    ...    ...
25968  25968  30-34    Man
25969  25969  22-24    Man
25970  25970  50-54    Man
25971  25971  45-49    Man
25972  25972  18-21    Man

[25973 rows x 3 columns]

In [26]:
data_xml.to_csv("../Archivos/xml_limpio.csv")